import os
import time

class Config(object):
    # Pyrogram Client
    API_ID    = int(os.environ.get("API_ID", "12380656"))  # ⚠ Required
    API_HASH  = os.environ.get("API_HASH", "d927c13beaaf5110f25c505b7c071273") # ⚠ Required
    BOT_TOKEN = os.environ.get("BOT_TOKEN", "7001693054:AAFLbXfhfXmi71_IKx4wxVrP-YfzADdpdIs") # ⚠️ Required
    
    # Other Configs
    BOT_START_TIME = time.time()
    OWNER    = int(os.environ.get("OWNER", "6656608288"))  # ⚠ Required
    SUDO = list(map(int, os.environ.get("SUDO", "6656608288").split()))  # ⚠ Required
    # Web Response Config
    WEBHOOK = bool(os.environ.get("WEBHOOK", True))
    PORT = int(os.environ.get("PORT", "8080"))

class Txt(object):

    SEND_NUMBERS_MSG = """
❪ • ѕєη∂ тнє тσтαℓ ηυмвєя уσυ нανє • ❫

☛ нσω мαηу ηυмвєя ∂σ уσυ нανє
"""

    SEND_TARGET_CHANNEL = """
❪ • ѕєη∂ тнє тαяgєт ¢нαηηєℓ ℓιηк σя υѕєяηαмє • ❫

☛ ƒσя e.g :- <code> @ </code> or <code> https:/t.me/its_Aryaan </code>
"""

    SEND_SESSION_MSG = """
❪ • ѕєη∂ ѕєѕѕσιη ѕтяιηg • ❫

☛ gєηєяαтє ѕєѕѕιση ѕтяιηg ƒσям @


"""

    SEND_API_ID = """
❪ • ѕєη∂ αρι ι∂ • ❫

☛ Api_id gєт ƒяσм my.telegram.org
"""
    SEND_API_HASH = """
❪ ѕєη∂ αρι нαѕн ❫

☛ Api_hash gєт ƒяσм my.telegram.org
"""

    MAKE_CONFIG_DONE_MSG = """
уσυя {} α¢¢συηтѕ нαѕ вєєη α∂∂є∂

αη∂ ℓσgιη тσ тнє тαяgєт ¢нαηηєℓ/gяσυρ тσ яєρσят ιт.

➜ ¢ℓι¢к тнє вυттση вєℓℓσω тσ ѕєє тнє ηυмвєя σƒ тєℓєgяαм α¢¢συηт уσυ α∂∂є∂.
"""

    ADDED_ACCOUNT = """
уσυя нανє α∂∂є∂ {} α¢¢συηтѕ 

➜ ¢ℓι¢к тнє вυттση вєℓℓσω тσ ѕєє тнє мσяє ιηƒσ σƒ тнє тєℓєgяαм α¢¢συηтѕ ωнι¢н уσυ нανє∂ α∂∂є∂.
"""

    ACCOUNT_INFO = """
<b> ηαмє :- </b> <code> {0} </code>
<b> υι∂ :- </b> <code> {1} </code>
"""

    REPORT_CHOICE = """
❪ • ѕєℓє¢т яєαѕση ƒσя яєρσят • ❫

1. яєρσят ¢нιℓ∂ αвυѕє
2. яєρσят ¢σρуяιgнтє∂ ¢σηтєηт
3. яєρσят ιмρєяѕσηαтιση
4. яєρσят ιяяєℓєναηт gєσgяσυρ
5. яєρσят ιℓℓєgαℓ ∂υяg
6. яєρσят νισℓєη¢є
7. яєρσят ρєяѕσηαℓ ∂єтαιℓ
8. яєαѕση ρσяησgяαρну
9. яєρσят ѕραм

ωнαтѕ уσυя  яєαѕση: ѕєℓє¢т 1-9
"""

    SEND_NO_OF_REPORT_MSG = """
❪ • ѕєℓє¢т ηυмвєя σƒ яєρσятѕ • ❫

**ѕєη∂ ηυмвєя σƒ яєρσятѕ ωнι¢н уσυ ωαηт тσ яєρσят тσ тнιѕ @{}**

тнє вσт ωιℓℓ кєєρ яєρσятιηg тσ тαяgєт ¢нαηηєℓ σя gяσυρ υηтιℓ ιт'ѕ яєα¢н тнє ηυмвєя σƒ яєρσят. 
"""

    START_MSG = """
Hɪ {},

тнιѕ ιѕ тєℓєgяαм gяσυρ/¢нαηηєℓ αη∂ α¢¢συηт мαѕѕ яєρσятιηg вσт 

тнιѕ вσт ∂єνєℓσρє∂ ву :- [-𓆩𝙑𝙀𝙉𝙊𝙈 ꭗ‌ 𝙊𝙋𓆪](https://t.me/ITS_ARYAAN)
"""

    HELP_MSG = """
🕊 ¢σммαη∂ѕ

🪄 αναιℓαвℓє ¢σммαη∂ѕ:
⏣ /start - ¢нє¢к ι'м αℓινє 
⏣ /config - тσ мαкє ¢σηƒιg 
⏣ /del_config - ∂єℓєтє тнє ¢σηƒιg
⏣ /target - тσ ѕєє тнє тαяgєт ¢нαηηєℓ
⏣ /see_accounts - ѕєє αℓℓ тнє α¢¢συηтѕ уσυ α∂∂є∂
⏣ /add_account - α∂∂ ηєω α¢¢συηтѕ
⏣ /report - яєρσят тнє тαяgєт
⏣ /restart - яєѕтαят тнє вσт

🥀 ƒєαтυяєѕ:
► яєρσят α ѕιηgℓє ¢нαηηєℓ σя gяσυρ ωιтн мυℓтιρℓє ι∂'ѕ
► туρє σƒ яєρσят σρтιση αναιℓαвℓє
► ƒα¢ιℓιтιє тσ ¢нαηgє тнє тαяgєт ¢нαηηєℓ σя gяσυρ
► ƒα¢ιℓιтιє тσ α∂∂ тнє мυℓтιρℓєѕ α¢¢συηтѕ αƒтєя ση¢є уσυ мαкє ¢σηƒιg
► αℓℓ тнє α¢¢συηтѕ уσυ α∂∂є∂ ωιℓℓ αυтσмαтι¢αℓℓу ʝσιηє∂ тнє тαяgєт ¢нαηηєℓ σя gяσυρ
► ησ ηєє∂ тσ єηтєя ρнσηє ηυмвєя, ραѕѕωσя∂ σя σтρ ʝυѕт ѕєη∂ ѕєѕѕιση ѕтяιηg αη∂ тнαт'ѕ ιт
► ¢нє¢к тнє ѕєяνєя ѕтαтυѕ αη∂ яєѕσυя¢єѕ
"""

    ABOUT_MSG = """
- му ηαмє : <a href=https://t.me/{}>{}</a>
- ∂єνєℓσρєя : <a href=@Its_Aryaan</a>
- ℓιвяαяу : Pyrogram
- ℓαηgυαgє : 𝖯𝗒𝗍𝗁𝗈𝗇 𝟥
- ∂в: 𝖬𝗈𝗇𝗀𝗈𝖣𝖡
- ηιккι вσт ѕєяνєя : 𝖠𝗇𝗒𝖶𝗁𝖾𝗋𝖾
"""
